#pragma once




// DecrypOptionDlg 对话框
class DecrypOptionDlg : public CDialog
{
	DECLARE_DYNAMIC(DecrypOptionDlg)

public:
	DecrypOptionDlg(CWnd* pParent = NULL);   // 标准构造函数
	virtual ~DecrypOptionDlg();

// 对话框数据
	enum { IDD = IDD_DIALOG_DECRYP_CHOSE };

protected:
	virtual void DoDataExchange(CDataExchange* pDX);    // DDX/DDV 支持

	DECLARE_MESSAGE_MAP()
public:
	afx_msg void OnBnClickedButtonChoseFinish();
	//CString mDesUnKey;
	CString m3DesUnKey;
	//CString mAesUnKey;
	int CheckState;
	CString mDesUnKey;
	CString mAesUnKey;
	afx_msg void OnBnClickedButtonCreateKeys();


	static const int DATALENGTH=350;   //大数类型的长度
	static const int MLENGTH=10;       //质数的长度
	static const int TESTNUM=30;       //测试质数时的比较的次数
	static const int SKLENGTH=4;       //私钥的长度
	typedef signed char byteint[DATALENGTH];   //定义大数类型
	byteint ONEVALUE;
	byteint TWOVALUE;
	byteint ZEROVALUE;
	typedef signed char mtype[MLENGTH];        //定义质数的大数类型
	mtype Model[TESTNUM];  //TESTNUM big number to be compared ,TESTNUM是测试质数时的比较的次数
	mtype mZEROVALUE,tempModel;  //0 constant
	/*---------------------------------------------------------------------------
	功能：将指定的自定义的大数进行0初始化
	入口参数：大数A名
	返回值：无
	----------------------------------------------------------------------------*/
	void SetZero(byteint A);
	/*---------------------------------------------------------------------------
	功能：该函数用来从集合[1,b-1]中产生若干个用于检测的数，存放在Model[]中
	入口参数：无
	返回值：无
	----------------------------------------------------------------------------*/
	void Mdata();


	/*---------------------------------------------------------------------------
	功能：随机地产生一个大数奇数，长度为num，最高位不是0，存放在RandomA中
	入口参数：大数A，长度num
	返回值：无
	----------------------------------------------------------------------------*/
	void IntRandom(byteint RandomA,int num);
	/*---------------------------------------------------------------------------
	功能：将大数B拷贝到大数A中
	入口参数：大数A，大数B
	返回值：无
	----------------------------------------------------------------------------*/
	void IntCpy(byteint A,byteint B);


	/*---------------------------------------------------------------------------
	功能：大数SA减去大数SB，结果放入SC
	入口参数：被减数SA，减数SB，差SC
	返回值：无
	----------------------------------------------------------------------------*/
	void Substract(byteint SA,byteint SB,byteint SC);
	/*---------------------------------------------------------------------------
	功能：得到一个大数的非零位数
	入口参数：大数validtemp
	返回值：大数中非零的位数
	----------------------------------------------------------------------------*/
	int IntValid(byteint validtemp);
	/*---------------------------------------------------------------------------
	功能：比较两个大数A和B的大小
	入口参数：大数A和大数B
	返回值：A>B:return 1 ; A=B:return 0 ; A<B:return -1
	----------------------------------------------------------------------------*/
	int IntCmp(byteint A,byteint B);
	/*---------------------------------------------------------------------------
	功能：计算大数A÷B的结果，余数放在C中，商在D中
	入口参数：被除数A，除数B，余数C，商D
	返回值：无
	----------------------------------------------------------------------------*/
	void SetMode(byteint A,byteint B,byteint C,byteint D);
	/*---------------------------------------------------------------------------
	功能：该函数用来将十进制的大整数转换成二进制的数
	入口参数：需转换的大数B，二进制结果flag[400]
	返回值：无
	----------------------------------------------------------------------------*/
	void TransBi(byteint B,signed char flag[400]);
	/*---------------------------------------------------------------------------
	功能：将质数类型B拷贝到A中，实现类型转换
	入口参数：大数A，质数类型B
	返回值：无
	----------------------------------------------------------------------------*/
	//功能：将数B拷贝到大数A，实现类型转换
	void LoadInt(byteint A,mtype B);
	/*---------------------------------------------------------------------------
	功能：大数A与大数B相乘，结果放入C中 A×B->C
	入口参数：被乘数A和乘数B，结果C
	返回值：无
	----------------------------------------------------------------------------*/
	void Multiply(byteint A,byteint B,byteint C);

	/*---------------------------------------------------------------------------
	功能：该函数用来进行模幂算法，A为底数，模为c，二进制的指数B存放在数组flag中
	入口参数：底数A，模C，结果D，二进制质数flag[400]
	返回值：A^B=1(mod C),返回1；A^B=p-1(mod C),返回2；否则返回0
	----------------------------------------------------------------------------*/
	int PowerMode(byteint A,byteint C,byteint D,signed char flag[400]);
	/*---------------------------------------------------------------------------
	功能：产生一个质数
	入口参数：大数Prm
	返回值：产生成功，返回0
	----------------------------------------------------------------------------*/
	int Prime(byteint Prm);   
	/*---------------------------------------------------------------------------
	功能：计算模R
	入口参数：产生的质数p，q，模R
	返回值：无
	----------------------------------------------------------------------------*/
	void ComputingR(byteint p,byteint q,byteint R);
	/*---------------------------------------------------------------------------
	功能：计算$(r)
	入口参数：质数p，质数q，模$(r)放在Rvalue
	返回值：无
	----------------------------------------------------------------------------*/
	void ComputingRvalue(byteint p,byteint q,byteint Rvalue);
	/*---------------------------------------------------------------------------
	功能：A＋B的结果送C
	入口参数：大数A,B,C
	返回值：无
	----------------------------------------------------------------------------*/
	void Plus(byteint A,byteint B,byteint C);
	/*---------------------------------------------------------------------------
	功能：计算公钥PK
	入口参数：$(r)的值在Rvalue中，私钥SK，公钥PK
	返回值：成功找到，返回1
	----------------------------------------------------------------------------*/
	int ComputingPK(byteint Rvalue,byteint SK,byteint PK);

};
